In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
engine = create_engine("postgresql+psycopg2://postgres:postgres@localhost:5432/lahman_baseball")
df = pd.read_sql("SELECT * FROM batting;", con=engine)
df.head()

,playerid,yearid,stint,teamid,lgid,g,ab,r,h,h2b,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
0,abercda01,1871,1,TRO,NA,1,4,0,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NA,25,118,30,32,6,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,NaN
2,allisar01,1871,1,CL1,NA,29,137,28,40,4,...,19.0,3.0,1.0,2,5.0,NaN,NaN,NaN,NaN,NaN
3,allisdo01,1871,1,WS3,NA,27,133,28,44,10,...,27.0,1.0,1.0,0,2.0,NaN,NaN,NaN,NaN,NaN
4,ansonca01,1871,1,RC1,NA,25,120,29,39,11,...,16.0,6.0,2.0,2,1.0,NaN,NaN,NaN,NaN,NaN

### 1.
#### a. Find all players in the database who played at Vanderbilt University.

#### b. Create a list showing each player’s first and last names as well as the total salary they earned in the major leagues.

#### c. Sort this list in descending order by the total salary earned.

#### d. Which Vanderbilt player earned the most money in the majors?

In [15]:
#load school data
schools = pd.read_sql('SELECT * FROM schools', con=engine)
#schools

#find vanderbilt info for schoolid
vanderbilt = schools[schools['schoolname'] == 'Vanderbilt University']
vanderbilt

     schoolid             schoolname schoolcity schoolstate schoolnick
1110    vandy  Vanderbilt University  Nashville          TN        USA

In [16]:
#load college players data
college_playing = pd.read_sql('SELECT * FROM collegeplaying', con=engine)
#college_playing.head()

#create df of players from vandy by filtering on schoolid
vandy_players = college_playing[college_playing['schoolid'] == 'vandy']
vandy_players

        playerid schoolid  yearid
232    alvarpe01    vandy    2006
233    alvarpe01    vandy    2007
234    alvarpe01    vandy    2008
895    baxtemi01    vandy    2004
896    baxtemi01    vandy    2005
...          ...      ...     ...
16806  willimi01    vandy    1970
16807  willimi01    vandy    1971
16808  willimi01    vandy    1972
17280   zeidjo01    vandy    2006
17281   zeidjo01    vandy    2007

[65 rows x 3 columns]

In [17]:
#load salary data
salaries = pd.read_sql('SELECT * FROM salaries', con=engine)
#salaries.head()

#create salary df of vandy players by grouping by playerid and summing all salary info
vandy_sals = salaries[salaries['playerid'].isin(vandy_players['playerid'])]
vandy_sals = vandy_sals.groupby('playerid')['salary'].sum().reset_index()
vandy_sals.head()

    playerid      salary
0  alvarpe01  20681704.0
1  baxtemi01   2094418.0
2  chrisni01    500000.0
3   corajo01   5622500.0
4  flahery01   4061000.0

In [18]:
#load player df
people = pd.read_sql('SELECT * FROM people', con=engine)
#people.head()

#find players names from people df by filtering it with new vandy_players table created above
vandy_df = people[people['playerid'].isin(vandy_players['playerid'])]
vandy_df_names = vandy_df[['namegiven','namelast', 'playerid']]
#vandy_df_names

        namegiven    namelast   playerid      salary
0    Pedro Manuel     Alvarez  alvarpe01  20681704.0
1  Michael Joseph      Baxter  baxtemi01   2094418.0
2   Nicholas John  Christiani  chrisni01    500000.0
3    Cyril Wilson     Collins  colliwi01         NaN
4     Jose Manuel        Cora   corajo01   5622500.0

In [20]:
#merge players names with salaries/ids to get all relevant fields
v_df_name_sal = vandy_df_names.merge(vandy_sals, on='playerid', how='left')
#v_df_name_sal.head()

#sort the table on salary descending. print statement to show who was the highest paid
v_df_name_sal = v_df_name_sal.sort_values(by = 'salary', ascending=False)
v_df_name_sal.head()
v_df_name_sal[v_df_name_sal['salary']==v_df_name_sal['salary'].max()]

       namegiven namelast   playerid      salary
16  David Taylor    Price  priceda01  81851296.0

#### 2. Using the fielding table, group players into three groups based on their position: label players with position OF as "Outfield", those with position "SS", "1B", "2B", and "3B" as "Infield", and those with position "P" or "C" as "Battery". Determine the number of putouts made by each of these three groups in 2016.

In [26]:
fielding = pd.read_sql('SELECT * FROM fielding', con=engine)
#fielding.head()

#create a dictionary, use map method to use it as reference for new column 
pos_dict = {'OF':'outfield', 'SS':'infield', '1B':'infield', '2B':'infield', '3B':'infield', 'P':'battery', 'C':'battery'}
fielding['gen_pos'] = fielding['pos'].map(pos_dict)
#fielding

#filter to 2016
fielding_16 = fielding[fielding['yearid'] == 2016].groupby('gen_pos')['po'].sum().reset_index()
fielding_16

    gen_pos     po
0   battery  41424
1   infield  58934
2  outfield  29560

In [14]:
#with numpy

# fielding['gen_pos'] = np.select([(fielding['pos'] == 'OS'), 
#                                  (fielding['pos'] == 'SS') or (fielding['pos'] == '1B') or (fielding['pos'] == '2B') 
#                                  or (fielding['pos'] == '3B'),
#                                 (fielding['pos'] == 'P') or (fielding['pos']) == 'C'], ['outfield','infield','battery'])

### 3. 
#### a. From 1970 – 2016, what is the largest number of wins for a team that did not win the world series?

#### b. What is the smallest number of wins for a team that did win the world series?

#### c. Doing this will probably result in an unusually small number of wins for a world series champion – determine why this is the case.

#### d. Then redo your query, excluding the problem year.

#### e. How often from 1970 – 2016 was it the case that a team with the most wins also won the world series?

#### f. What percentage of the time?

In [33]:
#import teams df
teams = pd.read_sql("SELECT * FROM teams", con = engine)
#teams.head()

#teams that didn't win world series
teams_7016 = teams[(teams['yearid'] >= 1970) & (teams['yearid'] <= 2016)]
teams_7016 = teams_7016[['yearid','w','l','teamid','name','wswin']]
teams_7016_nwswin = teams_7016[teams_7016['wswin'] == 'N']
#teams_7016_nwswin

#teams that did win world series
teams_7016_ywswin = teams_7016[teams_7016['wswin'] == 'Y']
#teams_7016_ywswin

In [41]:
#filter highest wins for a team that didnt win ws
most_wins_nwswin = teams_7016_nwswin[teams_7016_nwswin['w'] == teams_7016_nwswin['w'].max()]
most_wins_nwswin

      yearid    w   l teamid              name wswin
2379    2001  116  46    SEA  Seattle Mariners     N

In [44]:
#filter lowest wins for a team that did win ws
most_wins_ywswin = teams_7016_ywswin[teams_7016_ywswin['w'] == teams_7016_ywswin['w'].min()]
most_wins_ywswin

      yearid   w   l teamid                 name wswin
1824    1981  63  47    LAN  Los Angeles Dodgers     Y

In [46]:
#take out 1981 (strike year) and calculate again
sans_1981 = teams_7016_ywswin[teams_7016_ywswin['yearid'] != 1981]
#filter highest wins for a team that didnt win ws
sans_1981_ywswin =  sans_1981[sans_1981['w'] == sans_1981['w'].min()]
sans_1981_ywswin

      yearid   w   l teamid                 name wswin
2530    2006  83  78    SLN  St. Louis Cardinals     Y